#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>

//sizeof内部的表达式不参与运算
//int main()
//{
//	short s = 0;
//	int a = 0;
//	printf("%d\n", sizeof(s = a + 5));//这里计算的是s(short类型)的大小
//	printf("%d\n", s);
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	// ~ 按位取反
//	//00000000000000000000000000000000
//	//11111111111111111111111111111111 - 补码
//	//11111111111111111111111111111110 - 反码
//	//10000000000000000000000000000001 - 原码
//	//即-1
//	printf("%d\n", ~a);
//	int a = 11;
//	a = a | (1 << 2);
//	printf("%d\n", a); //15
//	a = a & (~(1 << 2));
//	printf("%d\n", a);//11
//	return 0;
//}

//面试题
//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	//&&只要结果有一个0(假)后面的都不执行
//	//i = a++ && ++b && d++;//1 2 3 4
//	//||只要结果有一个1(真)后面的都不执行
//	i = a++ || ++b || d++;//1 3 3 4
//	printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);
//	return 0;
//}


////结构体
//struct Stu
//{
//	//成员变量
//	char name[20];
//	int age;
//	char id[20];
// };
//
//int main()
//{
//	//结构体变量
//	struct Stu s1 = { "张三",20,"20190123" };
//	//使用指针
//	struct Stu* ps = &s1;
//	printf("%s\n", ps->name);
//	printf("%d\n", ps->age);
//	printf("%s\n", ps->id);
//
//	/*printf("%s\n", (*ps).name);
//	printf("%s\n", (*ps).age);
//	printf("%s\n", (*ps).id);*/
//	
//	/*printf("%s\n", s1.name);
//	printf("%d\n", s1.age);
//	printf("%s\n", s1.id);*/
//	return 0;
//}

//隐式类型转换
//int main()
//{
//	//00000011 - a
//	char a = 3;
//	//01111111 - b
//	char b = 127;
//	//a和b如何相加
//	//00000000000000000000000000000011
//	//00000000000000000000000001111111
//	//00000000000000000000000010000010
//	//c - 10000010
//	//11111111111111111111111110000010 - c的补码
//	//11111111111111111111111110000001 - 反码
//	//10000000000000000000000001111110 - 原码
//	char c = a + b;//char类型只有8个比特位
//	printf("%d\n", c);
//	return 0;
//}
